<script>
export default {
    name: 'SubMenuList',
    props: {
        id: { type: Number },   
        isOpen: {
            type: Boolean,
            default: false
        }
    },    
    data(){
        return {
            subMenuList: [
                [ '防災・災害対策','火事・救急・AEDマップ','治安・防犯','みんなでつくるセーフコミュニティとしま' ],
                [ '届出・証明','年金・保険','税','マイナンバー 社会保障・税番号制度', '電子申請手続一覧'],
                [ 'ごみ・リサイクル','暮らしの衛生','消費生活','協働','区民ひろば','区民活動・サークル','NPO（特定非営利活動法人）・ボランティア' ],
                [ '健康・医療','高齢者福祉','障害者福祉','介護','生活福祉','総合高齢社会対策' ],
                [ '保育','妊娠・出産','子育て','としまの教育','子ども・若者','としま子ども若者応援プロジェクト' ],
                [ '文化','観光','スポーツ','生涯学習','オリンピック・パラリンピック','マンガ・アニメ' ],
                [ '住まい・生活環境','自然・エネルギー','土地・開発','都市計画・まちづくり','道路','交通','就職・労働','産業' ],
                [ '区の概要','重点プロジェクト','公民連携','施策・計画・予算・財政・行政評価','ようこそ区長室へ','区議会','組織と仕事','区政へのご意見','行政情報公開・個人情報保護・公文書','審議会・委員会','人権・平和','男女共同参画','広報','例規','刊行物・区政情報','デジタル化推進','選挙','監査','施設案内','入札・契約','人事・職員採用（正規職員）','よくある質問' ],
            ],
        }
    },
}
</script>
<template>
    <div id="SubMenuList">
        <ul>
            <li v-for="(li, id) in subMenuList[id]" :key="id" v-show="isOpen">{{ li }}</li>
        </ul>
    </div>    
</template>